flatiron_theater2/app/controllers/productions_controller.rb

SELECT "productions".* FROM "productions" WHERE "productions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_production
      @production = Production.find(params[:id])