flatiron_theater2/app/controllers/productions_controller.rb

  def index
    @productions = Production.all
---
SELECT "productions".* FROM "productions"

  def show


    # render json: @production


    production = Production.find(params[:id])
---
SELECT "productions".* FROM "productions" WHERE "productions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create

    production = Production.create(production_params)
---
INSERT INTO "productions" ("title", "genre", "description", "budget", "image", "director", "ongoing", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @production.update(production_params)
---
UPDATE "productions" SET "genre" = $1, "updated_at" = $2 WHERE "productions"."id" = $3  [["genre", "So so so sad"], ["updated_at", "2023-02-02 19:37:30.744460"], ["id", 3]]

  def destroy
    @production.destroy
---
DELETE FROM "productions" WHERE "productions"."id" = $1  [["id", 5]]

    def set_production
      @production = Production.find(params[:id])
---
SELECT "productions".* FROM "productions" WHERE "productions"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]